# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Doc\PSoc_Projects\2018UAV\10.25\UAV_Control\UAV_Control.cydsn\UAV_Control.cyprj
# Date: Fri, 26 Oct 2018 03:00:40 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {UART_JY901_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 35} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65 129} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {UART_Bluetooth_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 833 1667} [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for D:\Doc\PSoc_Projects\2018UAV\10.25\UAV_Control\UAV_Control.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Doc\PSoc_Projects\2018UAV\10.25\UAV_Control\UAV_Control.cydsn\UAV_Control.cyprj
# Date: Fri, 26 Oct 2018 03:00:30 GMT
